# S.capitalize()  Переводит первый символ строки в верхний регистр, а все остальные в нижний
# S.title()	Первую букву каждого слова переводит в верхний регистр, а все остальные в нижний
# S.strip([chars])	Удаление пробельных символов в начале и в конце строки
print("Задание 1")
S = input("Введите 2 слова через пробел:")
S = S.strip()
while True:
    if S.find(' ') != -1:
        S = S.split(' ')
        S[0] = ''.join(reversed(S[0]))
        S[0] = S[0].capitalize()
        S[1] = ''.join(reversed(S[1]))
        S[1] = S[1].capitalize()
        print(S[0] + ' ' + S[1])
        break
    elif S.find(' ') == -1:
        S = input("Строка была введена не верно! Введите 2 слова через пробел:")

print("Задание 2")
S = str(input("Введите строку:"))
N = chr(int(input("Введите число(код символа):")))
print(S.count(N))

print("Задание 3")
S_print = str('')
SS_print = str('')
N = int(input("Введите число:"))
for i in range(1, N + 1):
    S = str(i)
    S_print += str(S)
    S_R = S_print[1:N-1]
    S_R = ''.join(reversed(S_R))
    print(S_print + S_R)
for j in range(1, N + 1):
    SS = str(j)
    SS_print += str(SS)
    SS_R = SS_print[1:N-1]
    SS_R = ''.join(reversed(SS_R))
    print("{:>20}".format(SS_print + SS_R))

print("Задание 4")
S = input("Введите строку больше 15 символов:")
print("a. виведіть третій символ цього рядка:", S[2])
print("b. виведіть передостанній символ цього рядка:", S[-2])
print("c. виведіть перші п'ять символів цього рядка:", S[0], S[1], S[2], S[3], S[4])
print("d. виведіть весь рядок, крім двох останніх символів:", S[0:-2])
S_e = ''
for i in range(0, len(S)):
    if i % 2 == 0:
        S_e += str(S[i])
print("e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0,"
      " тому символи виводяться починаючиз першого)):", S_e)
S_f = ''
for i in range(0, len(S)+1):
    if i % 2 != 0:
        S_f += str(S[i])
print("f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка:", S_f)
S_g = ''.join(reversed(S))
print("g. виведіть усі символи у зворотному порядку:", S_g)
S_h = ''
S_h += ''.join(str(S[i]) for i in range(len(S)-1, 0, -2))
print("h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього:", S_h)
print("i. виведіть довжину цього рядка:", len(S))
