# print('Приветствую, меня зовут Гидеон, а как мне обращаться к Вам?')
# user_name = input('Веевдите своё имя:')
# print('Здравствуй ' + user_name + '!')
# a = int(input('Загадайте первое число:'))
# b = int(input('Загадайте второе число:'))
# print('Сумма загаданых вами чисел:', a, ' + ', b, ' = ', a + b)
# print('     /\      |       |-----   \   /\n','   /  \     |       |         \ /\n','  /____\    |       |----      *\n',' /      \   |       |         / \ \n',
#       '/        \  |_____  |-----   /   \ \n')

#     /\      |       |-----   \   /
#    /  \     |       |         \ /
#   /____\    |       |----      *
#  /      \   |       |         / \
# /        \  |_____  |-----   /   \

